<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.1//EN" "http://www.w3.org/TR/xhtml11/DTD/xhtml11.dtd">
<!--
This program is free software. It comes without any warranty, to
the extent permitted by applicable law. You can redistribute it
and/or modify it under the terms of the Do What The Fuck You Want
To Public License, Version 2, as published by Sam Hocevar and
reproduced below.

DO WHAT THE FUCK YOU WANT TO PUBLIC LICENSE
Version 2, December 2004

Copyright (C) 2004 Sam Hocevar <sam@hocevar.net>

        Everyone is permitted to copy and distribute verbatim or modified
        copies of this license document, and changing it is allowed as long
        as the name is changed.

DO WHAT THE FUCK YOU WANT TO PUBLIC LICENSE
TERMS AND CONDITIONS FOR COPYING, DISTRIBUTION AND MODIFICATION

        0. You just DO WHAT THE FUCK YOU WANT TO.
-->

<html xmlns="http://www.w3.org/1999/xhtml">
	<head>
		<title>Torrent-HowTo</title>
		<link rel="icon" href="../static/favicon.ico" type="image/x-icon" />
		<link rel="shortcut icon" href="../static/favicon.ico" type="image/x-icon" />
		<link rel="stylesheet" type="text/css" href="../static/piracy.css" />
		<meta name="robots" content="noindex,nofollow" />
		<!-- Background pattern provided by subtlepatterns.com -->
	</head>
	<body>
		<div id="center-wrap">
			<div id="content-wrap">
				<div id="content-title">
					<h1>Krempel via Torrent</h1>
					<h2>Eine Einleitung</h2>
				</div>
				<div id="content-main">
					<div>
						<h2>Intro</h2>
						<div class="section-padding">
							BitTorrent ist ein Protokoll, welches Dateien direkt zwischen den Teilnehmern austauscht,
							auch schon w&auml;hrend die Dateien nur unvollst&auml;ndig vorhanden sind - wenn eine vollst&auml;ndige Kopie
							im Netzwerk vorhanden ist, auch nachdem die Quelle aus dem Netzwerk verschwindet.
							Das macht es besonders geeignet f&uuml;r die schnelle und verl&auml;ssliche Verteilung von gro&szlig;en (oder auch kleinen) Dateien.
							<br/><br/>
							Das Bereitstellen von eigenen Dateien gestaltet sich aufgrund einiger Eigenheiten etwas aufw&auml;ndiger
							als bei manchen anderen Protokollen, weshalb dieses Dokument eine kurze Anleitung geben soll.
							<br/><br/>
							<strong>Begriffe</strong><br/>
							Client - Software, die BitTorrent spricht<br/>
							Tracker - Adressvermittlungsserver<br/>
							Leecher - Client der eine Datei anfordert<br/>
							Seeder - Client der eine Datei anbietet bzw. vollst&auml;ndig vorliegen hat<br/>
							Peer - Verbindungspartner (Seeder oder Leecher)
						</div>
					</div>

					<div>
						<h2>Protokoll</h2>
						<em>Dieser Abschnitt geht etwas auf technische Details ein, kann aber prinzipiell &uuml;bersprungen werden</em>				
						<div class="section-padding">
							BitTorrent besteht trotz der grundlegenden dezentralen Verteilung aus zwei Komponenten,
							einem Client (bspw. 
							<a href="http://www.binarynotions.com/halite-bittorrent-client/">Halite</a>,
							<a href="http://libtorrent.rakshasa.no/">rTorrent</a>,
							<a href="http://deluge-torrent.org/">Deluge</a>) 
							und einem Server (bspw. 
							<a href="http://erdgeist.org/arts/software/opentracker/">opentracker</a>, 
							<a href="https://github.com/abique/hefur">hefur</a>, 
							<a href="http://dev.cbcdn.com/traccoon/">traccoon</a>).
							Der Server dient jedoch nur zum Austauschen der Client-Adressen,
							die eigentlichen Datenverbindungen bauen die Clients untereinander auf.
							<br/><br/>
							Um Dateien zu verteilen, muss auf zuerst offline eine .torrent-Datei, welche Informationen &uuml;ber die zu verbreitenden
							Daten enth&auml;lt, erzeugt werden. Enthalten ist, neben einigen Meta-Informationen wie der Dateigr&ouml;&szlig;e, einem Kommentar
							und der Tracker-URL als wichtigstes Element der sogenannte "info-Key", welcher Hashes der in einzelne Bl&ouml;cke zerlegten
							Dateien enth&auml;lt. Der Inhalt einer .torrent-Datei l&auml;sst sich beispielsweise mit <a href="https://github.com/cbdevnet/traccoon/tree/master/torrentinfo">torrentinfo</a> betrachten.
							<br/><br/>
							Eine .torrent-Datei laesst sich (semi-)eindeutig anhand des SHA1-Hashes ihres info-Keys identifizieren.
							Die meisten Tracker halten daher eine Datenbank der Hashes vor, f&uuml;r welche sie Client-Adressen verteilen,
							m&uuml;ssen also mindestens diese Information auch erhalten, bevor die Verteilung beginnen kann.
							<br/><br/>
							Als letzten Schritt muss nun die .torrent-Datei, welche meist nur wenige Kilobytes gro&szlig; ist, auf den/die Zielcomputer
							geschoben werden (bspw. per HTTP).
						</div>
					</div>

					<div>
						<h2>Umfang eines Torrents</h2>
						<div class="section-padding">
							Ein Torrent sollte immer eine logische Einheit bilden - es ist zwar m&ouml;glich nur bestimmte Dateien eines
							Torrents herunterzuladen, erzeugt aber Mehraufwand sowohl auf der Seederseite (l&auml;ngeres Hashen) als auch
							auf der Leecherseite (mehr klicken).
							<br/><br/>
							Eine logische Einheit bilden bspw.<br/>
							<ul>
								<li>Ein Linux-CD-Image mit Beschreibung und passender Stickervorlage</li>
								<li>Das Album deiner Band mitsamt unterschriebener Legalit&auml;tserkl&auml;rung</li>
								<li>TPB:AFK in 1080P mit Subtitle-Files und allem drum und dran</li>
								<li>Freie Software mitsamt dem PDF vom Wikibook dazu</li>
							</ul>
							<strong>Keine</strong> logische Einheit bilden aber<br/>
							<ul>
								<li>Deine komplette Festplatte</li>
								<li>Unsortierte Mediendateien (ausser in bestimmten Faellen)</li>
							</ul><br/>
							Sollte dein spezieller Fall in keine der Kategorien passen, denk nach in welchen Granularit&auml;ten du
							deine Sachen am liebsten herunterladen w&uuml;rdest. Anders gesagt: Hirn anschalten. Oder halt jemand anderst fragen.
						</div>
					</div>

					<div>
						<h2>Torrentfile erzeugen</h2>
						<div class="section-padding">
							Jetzt kommt der spannende Teil. Um einen Torrent zu erzeugen, starten wir zun&auml;chst den Client unserer Wahl.
							Dort schauen wir uns in den diversen Men&uuml;s nach einer Option um, die in etwa &quot;Neuen Torrent erstellen&quot; hei&szlig;t,
							worauf wir vermutlich mit einem den folgenden Dialogen &auml;hnlichen Bild begr&uuml;&szlig;t werden.<br/>
							<img src="img/ut_newtorrent.jpg" style="height:20em;float:left;" alt="New Torrent Dialog" /><br/>
							Torrents k&ouml;nnen immer jeweils entweder genau eine Datei oder genau einen Ordner (inkl. Unterordner) enthalten.
							Es empfiehlt sich, die zu verteilenden Dateien in benannte Ordner zu stecken und diese dann Auszuw&auml;hlen.
							In das &quot;Trackers&quot;-Feld kommen, wie sicher schon erraten, die Adressen der Tracker, die du bestimmt schon
							auf irgendwelchen Wegen mitgeteilt bekommen hast. Einen deskriptiven Kommentar einzutragen ist immer gern gesehen.
							Sollte der Dialog die Option &quot;Private torrent&quot; anbieten, empfiehlt es sich den Haken zu setzen (verhindert die Weitergabe
							der internen Adressen an externe Tracker und Peers im Internet - nicht zwingend schlimm, aber etwas nutzlos).
							Die Option &quot;Power seeding&quot; bzw. &quot;Super seeding&quot; sollte jedoch ausgeschaltet werden, diese bringt nur bei einer asymmetrischen
							Anbindung an Peers Vorteile.
							<br/><br/>
							Der n&auml;chste Schritt des Clients wird nun eine, je nach Dateigr&ouml;&szlig;e variierend lange, Berechnung sein, in der
							die Hashes der einzelnen Dateisplitter berechnet werden. Das Ergebnis dieses Prozesses ist dann die ersehnte .torrent-Datei.
							<br/><br/>
							Unter Linux lassen sich Torrentfiles recht einfach mit &quot;mktorrent&quot; erzeugen.<br />
							<code>
								mktorrent -v -a &lt;announce&gt; -p &lt;file or directory&gt;
							</code><br/>
							Folgendes Beispielskript akzeptiert auf stdin eine Liste von Dateien oder Ordnern und erzeugt dann im aktuellen Verzeichnis
							die zugeh&ouml;rigen Torrentfiles:<br />
							<code>
								#!/bin/bash<br/>
								while read line; do<br/>
								echo "Now hashing: $line"<br/>
								mktorrent -v -a http://10.42.23.1:6969/announce -p "$line"<br/>
								done
							</code><br/>
							Aufruf beispielsweise mit<br/>
							<code>
								find ../Legales_Zeug/ -maxdepth 1 -type d | tail -n +2 | ./torrentify
							</code><br/>
							Erklärung der Parameter:<br />
							<code>[find] -maxdepth 1</code> Nicht in Unterordner verzweigen<br/>
							<code>[find] -type d</code> Nur Ordner anzeigen<br/>
							<code>[tail] -n +2</code> Ersten beiden Egebniszeilen des find-Befehls nicht zeigen (. und ..)<br/>
						</div>
					</div>

					<div>
						<h2>Tracker</h2>
						<div class="section-padding">
							Sollte dein Client so schlau gewesen sein und gleich mit dem Seeden angefangen haben, wirst du sehr wahrscheinlich in
							eine Fehlermeldung laufen - im Falle traccoons so etwas wie &quot;Hash not recognized&quot;. Der Tracker kennt den Torrent
							noch nicht und nimmt daher keine Vermittlung vor. Dem wird mit dem Eintragen des Torrents im Trackerpanel abgeholfen.
							Viele Tracker bieten auch eine Kategorisierung sowie einen Browser ihrer aktiven Torrents an.
						</div>
					</div>

					<div>
						<h2>Seeden</h2>
						<div class="section-padding">
							Sollte dein Client den erzeugten Torrent nicht automatisch hinzugef&uuml;gt haben oder aus mysteri&ouml;sen Gr&uuml;nden nicht
							seeden, kann es helfen den Torrent hinzuzuf&uuml;gen als wollte man ihn herunterladen, und als Speicherort den Quellordner w&auml;hlen
							(quasi die Originaldateien &uuml;berschreiben). Der Client wird das bemerken, &uuml;berpr&uuml;fen ob die Dateien vollst&auml;ndig sind und mit
							dem seeden beginnen.
							<br/><br/>
							Sobald alle Teile deiner Dateien mindestens einmal im Netzwerk vorhanden sind (auch wenn jeder Peer nur einen Teil hat), ist es m&ouml;glich
							die vollst&auml;ndige Datei auch ohne dein Zutun wieder zusammenzusetzen, du kannst den Torrent daher theoretisch l&ouml;schen - es ist allerdings
							guter Stil seine Torrents m&ouml;glichst lange zu seeden, zumal das in einem lokalen Netzwerk sowieso problemlos ist.
							<br/><br/>
							Gratulation, du hast jetzt das Handwerkszeug zum Internetpirat!<br/><br/>
						</div>
					</div>
					
				</div>
				
				<div id="content-foot">
					<a href="../">#kitinfo Sharingparty Portal</a> - BitTorrent HowTo
				</div>
			</div>
			<div style="text-align:right;padding:0.3em 1em 0 1em;">
				<a href="http://www.kopimi.com/kopimi/"><img src="../static/kopimi.png"/></a>
				<a href="http://wtfpl.net/"><img src="../static/wtfpl.png"/></a>
			</div>
		</div>
	</body>
</html>
